# Proyek Akhir: Menyelesaikan Permasalahan Perusahaan Edutech

- Nama: Muhammad Faishal Ali Dhiaulhaq
- Email: faishalald22@gmail.com
- Id Dicoding:

## Persiapan

### Menyiapkan Library yang Dibutuhkan

In [1]:
import pandas as pd

### Menyiapkan Data yang Akan Digunakan

In [4]:
DATA_PATH = 'data/data.csv'

df = pd.read_csv(DATA_PATH, encoding='windows-1252', sep=';')

In [5]:
df.head()

,ï»¿Marital_status,Application_mode,Application_order,Course,Daytime_evening_attendance,Previous_qualification,Previous_qualification_grade,Nacionality,Mothers_qualification,Fathers_qualification,...,Curricular_units_2nd_sem_credited,Curricular_units_2nd_sem_enrolled,Curricular_units_2nd_sem_evaluations,Curricular_units_2nd_sem_approved,Curricular_units_2nd_sem_grade,Curricular_units_2nd_sem_without_evaluations,Unemployment_rate,Inflation_rate,GDP,Status
0,1,17,5,171,1,1,122.0,1,19,12,...,0,0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,1,15,1,9254,1,1,160.0,1,1,3,...,0,6,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,1,1,5,9070,1,1,122.0,1,37,37,...,0,6,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,1,17,2,9773,1,1,122.0,1,38,37,...,0,6,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,2,39,1,8014,0,1,100.0,1,37,38,...,0,6,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

## Data Understanding

## Informasi Umum Dataset

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4424 entries, 0 to 4423
Data columns (total 37 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   ï»¿Marital_status                             4424 non-null   int64
 1   Application_mode                              4424 non-null   int64
 2   Application_order                             4424 non-null   int64
 3   Course                                        4424 non-null   int64
 4   Daytime_evening_attendance                    4424 non-null   int64
 5   Previous_qualification                        4424 non-null   int64
 6   Previous_qualification_grade                  4424 non-null   float64
 7   Nacionality                                   4424 non-null   int64
 8   Mothers_qualification                         4424 non-null   int64
 9   Fathers_qualification                         4424 non-null   int64
 10  Mothers_occupation                            4424 non-null   int64
 11  Fathers_occupation                            4424 non-null   int64
 12  Admission_grade                               4424 non-null   float64
 13  Displaced                                     4424 non-null   int64
 14  Educational_special_needs                     4424 non-null   int64
 15  Debtor                                        4424 non-null   int64
 16  Tuition_fees_up_to_date                       4424 non-null   int64
 17  Gender                                        4424 non-null   int64
 18  Scholarship_holder                            4424 non-null   int64
 19  Age_at_enrollment                             4424 non-null   int64
 20  International                                 4424 non-null   int64
 21  Curricular_units_1st_sem_credited             4424 non-null   int64
 22  Curricular_units_1st_sem_enrolled             4424 non-null   int64
 23  Curricular_units_1st_sem_evaluations          4424 non-null   int64
 24  Curricular_units_1st_sem_approved             4424 non-null   int64
 25  Curricular_units_1st_sem_grade                4424 non-null   float64
 26  Curricular_units_1st_sem_without_evaluations  4424 non-null   int64
 27  Curricular_units_2nd_sem_credited             4424 non-null   int64
 28  Curricular_units_2nd_sem_enrolled             4424 non-null   int64
 29  Curricular_units_2nd_sem_evaluations          4424 non-null   int64
 30  Curricular_units_2nd_sem_approved             4424 non-null   int64
 31  Curricular_units_2nd_sem_grade                4424 non-null   float64
 32  Curricular_units_2nd_sem_without_evaluations  4424 non-null   int64
 33  Unemployment_rate                             4424 non-null   float64
 34  Inflation_rate                                4424 non-null   float64
 35  GDP                                           4424 non-null   float64
 36  Status                                        4424 non-null   object
dtypes: float64(7), int64(29), object(1)
memory usage: 1.2+ MB

## Data Preparation / Preprocessing

## Modeling

## Evaluation